VV_cases/V1_solver/results/study_v1/runs/004_data_of13_fluid_consistency_short/simulations/b030_medium_Re090/openfoam_setup/0.orig/p_rgh
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    inlet { type fixedFluxPressure; value uniform 0; }
    outlet { type fixedValue; value uniform 0; }
    top { type fixedFluxPressure; value uniform 0; }
    bottom { type fixedFluxPressure; value uniform 0; }
    cylinder { type fixedFluxPressure; value uniform 0; }
    front { type symmetryPlane; }
    back { type symmetryPlane; }
}
